In [1]:
!pip install geopy

Collecting geopy
  Downloading geopy-2.4.1-py3-none-any.whl.metadata (6.8 kB)
Collecting geographiclib<3,>=1.52 (from geopy)
  Downloading geographiclib-2.0-py3-none-any.whl.metadata (1.4 kB)
Downloading geopy-2.4.1-py3-none-any.whl (125 kB)
Downloading geographiclib-2.0-py3-none-any.whl (40 kB)
Installing collected packages: geographiclib, geopy
Successfully installed geographiclib-2.0 geopy-2.4.1

In [3]:
import pandas as pd

In [7]:
from geopy.geocoders import Nominatim

In [11]:
from geopy.exc import GeocoderTimedOut

In [15]:
from geopy.extra.rate_limiter import RateLimiter

In [27]:
df = pd.read_csv('/Users/soe.sone/Desktop/Running_data_project/ff_race_50.csv')

In [29]:
df.head()

,Place,First,Last,City,State,Age,Division,Time,Unnamed: 8,Unnamed: 9
0,1,Daniel,Wilson,Tulsa,OK,35,M,8:23:01,NaN,NaN
1,2,Eric,Davis,Greenwood,IN,38,M,8:57:54,NaN,NaN
2,3,Stewart,Edwards,New Smyrna Beach,FL,43,M,9:24:35,NaN,
3,4,Ron,Hammett,Montverde,FL,53,M,9:24:36,NaN,NaN
4,5,Seth,Cain,Geneva,FL,44,M,9:42:17,NaN,NaN

In [31]:
df2 = df.dropna(axis=1)

In [33]:
df2.head()

   Place    First     Last              City State  Age Division     Time
0      1   Daniel   Wilson             Tulsa    OK   35        M  8:23:01
1      2     Eric    Davis         Greenwood    IN   38        M  8:57:54
2      3  Stewart  Edwards  New Smyrna Beach    FL   43        M  9:24:35
3      4      Ron  Hammett         Montverde    FL   53        M  9:24:36
4      5     Seth     Cain            Geneva    FL   44        M  9:42:17

In [43]:
df2.loc[:, 'Time'] = pd.to_timedelta(df2['Time'])

In [45]:
df2['Total_minutes'] = df2['Time'].dt.total_seconds() / 60

In [49]:
df2['Total_minutes'] = df2['Total_minutes'].round().astype(int)

In [51]:
df2.head()

,Place,First,Last,City,State,Age,Division,Time,fullname,Total_minutes
0,1,Daniel,Wilson,Tulsa,OK,35,M,0 days 08:23:01,Daniel Wilson,503
1,2,Eric,Davis,Greenwood,IN,38,M,0 days 08:57:54,Eric Davis,538
2,3,Stewart,Edwards,New Smyrna Beach,FL,43,M,0 days 09:24:35,Stewart Edwards,565
3,4,Ron,Hammett,Montverde,FL,53,M,0 days 09:24:36,Ron Hammett,565
4,5,Seth,Cain,Geneva,FL,44,M,0 days 09:42:17,Seth Cain,582

In [53]:
df2.rename(columns={'Division' : 'Gender'}, inplace=True)

In [57]:
def get_lat_long(city, state): 
    address = f"{city}, {state}"
    try: 
        geolocator = Nominatim(user_agent = 'running', timeout=10)
        location = geolocator.geocode(address)
        if location:
            return location.latitude, location.longitude
        else:
            return None, None 
    except GeocoderTimedOut:
        return None, None

In [60]:
df2['latitue'],df2['longitude'] = zip(*df2.apply(lambda x: get_lat_long(x['City'], x['State']), axis = 1))

In [62]:
df2.head()

,Place,First,Last,City,State,Age,Gender,Time,fullname,Total_minutes,latitue,longitude
0,1,Daniel,Wilson,Tulsa,OK,35,M,0 days 08:23:01,Daniel Wilson,503,36.156312,-95.992752
1,2,Eric,Davis,Greenwood,IN,38,M,0 days 08:57:54,Eric Davis,538,39.613699,-86.109543
2,3,Stewart,Edwards,New Smyrna Beach,FL,43,M,0 days 09:24:35,Stewart Edwards,565,29.025813,-80.927127
3,4,Ron,Hammett,Montverde,FL,53,M,0 days 09:24:36,Ron Hammett,565,28.600277,-81.673964
4,5,Seth,Cain,Geneva,FL,44,M,0 days 09:42:17,Seth Cain,582,28.739716,-81.115062

In [68]:
df2['latlong'] = df2['latitue'].astype(str) + ', ' + df2['longitude'].astype(str)

In [70]:
df2.head()

,Place,First,Last,City,State,Age,Gender,Time,fullname,Total_minutes,latitue,longitude,latlong
0,1,Daniel,Wilson,Tulsa,OK,35,M,0 days 08:23:01,Daniel Wilson,503,36.156312,-95.992752,"36.1563122, -95.9927516"
1,2,Eric,Davis,Greenwood,IN,38,M,0 days 08:57:54,Eric Davis,538,39.613699,-86.109543,"39.6136987, -86.1095429"
2,3,Stewart,Edwards,New Smyrna Beach,FL,43,M,0 days 09:24:35,Stewart Edwards,565,29.025813,-80.927127,"29.0258132, -80.9271271"
3,4,Ron,Hammett,Montverde,FL,53,M,0 days 09:24:36,Ron Hammett,565,28.600277,-81.673964,"28.6002769, -81.673964"
4,5,Seth,Cain,Geneva,FL,44,M,0 days 09:42:17,Seth Cain,582,28.739716,-81.115062,"28.7397163, -81.1150616"

In [72]:
df2.rename(columns={'latitue' : 'latitude'}, inplace=True)

In [74]:
df2.to_csv('ultracleanedupdate_output.csv', index = False)